wcm/widget/Calendario/src/main/webapp/resources/js/xmls/ECMCardService_update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.dm.ecm.technology.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:updateCardData>
         <companyId></companyId>
         <username></username>
         <password></password>
         <cardId></cardId>
         <cardData>
           <item>
               <field>event</field>
               <value name="event"/>
           </item>
           <item>
               <field>publicEvent</field>
               <value name="publicEvent"/>
           </item>
           <item>
               <field>description</field>
               <value name="description"/>
           </item>
           <item>
               <field>eventcolor</field>
               <value name="eventcolor"/>
           </item>
           <item>
               <field>participatingUsers</field>
               <value name="participatingUsers"/>
           </item>
           <item>
               <field>participatingGroups</field>
               <value name="participatingGroups"/>
           </item>                    
           <item>
               <field>creator</field>
               <value name="creator"/>
           </item>
           <item>
               <field>startDate</field>
               <value name="startDate"/>
           </item>
           <item>
               <field>startHour</field>
               <value name="startHour"/>
           </item>
           <item>
               <field>endDate</field>
               <value name="endDate"/>
           </item>
           <item>
               <field>endHour</field>
               <value name="endHour"/>
           </item>
           <item>
               <field>files</field>
               <value name="files"/>
           </item>
           <item>
               <field>havetoaccept</field>
               <value name="havetoaccept"/>
           </item>
           <item>
               <field>usersthataccepted</field>
               <value name="usersthataccepted"/>
           </item>
           <item>
           	   <field>usersthatrefuse</field>
           	   <value name="usersthatrefuse"/>
           </item>
           <item>
           	   <field>localevent</field>
           	   <value name="localevent"/>
           </item>
           <item>
				<field>departamento</field>
				<value name="departamento"/>
		   </item>
           <item>
               <field>ata</field>
               <value name="ata"/>
           </item>           
           <item>
           		<field>linkcalendarevent</field>
           		<value name="linkcalendarevent"/>
           </item>
           <item>
           	   <field>externalusers</field>
           	   <value name="externalusers"/>
           </item>
           <item>
           	   <field>remetente_nome</field>
           	   <value name="remetente_nome"/>
           </item>
           <item>
           	   <field>remetente_email</field>
           	   <value name="remetente_email"/>
           </item>
         </cardData>
      </ws:updateCardData>
   </soapenv:Body>
</soapenv:Envelope>